_posts/2016-05-05-Templating For Excel.html
---
title: Templating For Excel
tagline: Returning to Excel probably one more time
layout: post
author: Francis Murillo
categories: Insight
tags: Excel
---

<p>
When I was running/reading a test script written in Excel, I noticed
several repeating snippets or blocks that the tester would have to
update based on a pending clarification; this means that the tester
would have to change several repeating blocks of around 30 test
sheets. What a menial task for a tester or anyone to do.
</p>

<p>
And so, I did the unthinkable. I said that somebody can come up with a
simple templating macro language  which is the mini equivalent of
<a href="https://mustache.github.io/">Mustache</a> or  <a href="https://angularjs.org/">Angular</a> for Excel. I said it would be small and simple
where a tester can define snippets or blocks and compile it into an test
sheet, more or less. I said it would save testers the task of editing
several sheets over and over again.
</p>

<p>
That what I said if I was the tester. Why did I say that? Now I had to
create a POC for it or risk being insulted for coming up with an idea
that no one can do. Actually, if I did not do it, they might believe
that it is the only way.
</p>

<p>
Maybe hope? Or just use a text file format with Emacs and org-mode. Or
that I'm an idiot for suggesting testers learn Emacs. And after my
weekend work, I decided to install VirtualBox and download an Window 7
image, yuck; On May 01, 2016, I decided to work on it.
</p>

<p>
And within 24 hours, I cranked out a small templating engine for Excel
called <a href="https://github.com/FrancisMurillo/xlnosheet">xlnosheet</a> (pun very much intended). It accomplishes the task
which I thought it would do and here I reflect on my work.
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">VBA sucks</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
So many things to say here but I am quite happy that my previous
tooling was easy to integrate into this new endeavor. The git
integration, unit testing and utilities. Using it gave me a sense of zen or
harmony with my work.
</p>

<p>
Although there is no strong coding style for modules or classes. I
decided to implement a JavaScript object type or Python dictionary
class using a simple array implementation and it works good enough
considering VBA is very restrictive and a map or object allows greater
freedom with the data types.
</p>

<p>
Although the language sucks, I still had some fun with redefining the
basic atoms of a language as a sort of homage or analysis
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Inspired Templates</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
Again, the idea is to declare several snippets and then combine and
compile it. The question is how to declare snippets: one snippet per
sheet or multiple snippets per sheet. I took the later one since if
you create a lot of snippets, it would be a maintenance nightmare to
scroll or browse through the snippets and into the actual text blocks;
so I opted to define multiple snippets. By the way, text blocks are
combined snippets and lines which you compile to create your new
block.
</p>

<p>
I decided to use a simple start token and end token to create snippet
blocks. Next problem: how do you call them by name? This problem is
pretty much just giving snippets properties and how do you do that?
How do you put metadata or properties with Excel?
</p>

<p>
I chose to implement key value pairs with pair lines starting with a
property prefix. Something like an inline property file with Excel
using the first column as keys and the second as values. It was easy
to implement with the new object data type I just crafted.
</p>

<p>
With the naming system in place, it looks something like this.
</p>

<div class="org-src-container">

<pre class="src src-text">&lt;&lt;&lt;
:name MySnipet
Start of block
Do some wierd things
Blah blah
&gt;&gt;&gt;
</pre>
</div>

<p>
Now how do we call this snippets? I choose the Mustache way of
declaring it. Finally, I get my way.
</p>

<div class="org-src-container">

<pre class="src src-text">&lt;&lt;&lt;
:name SomeTextBlock
About to call my snippet
{{SomeSnippetName}}
End of snippet
&gt;&gt;&gt;
</pre>
</div>

<p>
With that idea, I am set to implement it.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">Passing Parameters</h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
As a developer, I prefer my snippets to have some parameters. Which
was easily implemented with the help of the new object data
type. I'm thinking of some sort of dynamic object scope, since
functional scope is way too hard or complex for this project PoC. Here
is what I though of property scopes
</p>

<ul class="org-ul">
<li><p>
Application
</p>

<p>
The main application properties which blocks inherit.
</p>

<ul class="org-ul">
<li><p>
Block
</p>

<p>
Text blocks get the application properties as well as the chance
to override it
</p></li>
</ul></li>

<li><p>
Snippet
</p>

<p>
Snippet properties are independent of the application
</p></li>
</ul>

<p>
So with a simple property hierarchy in place, I have a mild form of
reuse with static parameters. The driving idea here is that imagine
you have two paragraphs and it only differs in one word, wouldn't it
be nice to have that wild word as a parameter that you can replace and
keep the paragraph in tact. Basically, avoid repeating myself over one
word.
</p>

<p>
The two things I found fun with this is merging two objects or
properties like in JavaScript <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/assign">Object.assign</a> and the power to define
what syntax to call a property. It sort of feels good to do it out of
a cheap language. It looks like this
</p>

<div class="org-src-container">

<pre class="src src-text">&lt;&lt;&lt;
:role Admin
{{snippetThatDependsOnRole}}
A random line
A random line invoking role: #{role}
This is the document author #{author}, so say hello to him
&gt;&gt;&gt;
</pre>
</div>

<p>
Aside from the implementation detail, it looks really fine enough for
a simple templating engine
</p>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4">Conclusion</h2>
<div class="outline-text-2" id="text-orgheadline4">
<p>
At the end of it all, I had fun implementing the old concepts from a
modern standpoint. I guess there is joy in going back to how it all came
to be. The engine has a lot more improvements which I can foresee.
</p>

<ul class="org-ul">
<li>Snippets within a snippet
<ul class="org-ul">
<li>Circular recursion check</li>
</ul></li>
<li>Overwrite, not delete
<ul class="org-ul">
<li>Bounded regions</li>
</ul></li>
<li>Go to a snippet or block (like in Emacs buffer)
<ul class="org-ul">
<li>Go to target sheet</li>
<li>Refactor snippets</li>
<li>Snippet depedency</li>
</ul></li>
<li>Codintional snippets (Sweet mercy, a language within a language)
<ul class="org-ul">
<li>Dynamic properties</li>
</ul></li>
</ul>

<p>
But the hardest thing I have to do is make some form of documentation,
yuck, because I fear no one will ever use it. But if I were really a
tester, I would improve it like it was no one's business. It's really
just nice creating your own tool.
</p>

<p>
But really my point is not really about VBA, it was just an annotation;
rather it is about trying to automate your own task. I guess it is just
a mindset whenever you find a menial task that can be simply automated
or a block of code that can be refactored, then why not? Whatever our
craft is, I guess we just want to do our job.
</p>
</div>
</div>
